// Створити масив з числами від 1 до 5.
// Вивести на екран кожен елемент масиву за допомогою циклу while.

let numbers = [1, 2, 3, 4, 5];

let i = 0;

while (i < numbers.length) {
  console.log(numbers[i]);
  i++;
}

// Створити масив із числами від 1 до 10. За допомогою циклу
// for пройтися по масиву та вивести на екран всі числа, крім числа 7.
let numbersArray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

for (let i = 0; i < numbersArray.length; i++) {
  if (numbersArray[i] !== 7) {
    console.log(numbersArray[i]);
  }
}

// Якщо зустрінете число 7, закінчити виконання
// циклу за допомогою оператора break.
for (let i = 1; i <= 10; i++) {
  if (i === 7) {
    break;
  }
  console.log(i);
}

//   Створити скрипт, який виводить на екран всі числа ,
//    які менші за n. Якщо зустрічається число, що більше або дорівнює n,
//   цикл повинен бути закінчений за допомогою break.
let n = 13;

for (let i = 0; i < n; i++) {
  if (i >= n) {
    break;
  }
  console.log(i);
}

// За допомогою циклу while вивести на екран всі числа
//  від 1 до 20, крім чисел, кратних 3.
//  Якщо зустрінете число, кратне 3, цикл повинен продовжити
// виконання за допомогою оператора continue.
let a = 1;

while (a <= 20) {
  if (a % 3 === 0) {
    a++;
    continue;
  }
  console.log(a);
  a++;
}

// Вивести на екран таблицю множення числа 7 за допомогою циклу for.

for (let i = 1; i <= 10; i++) {
  let result = 7 * i;
  console.log(`7 * ${i} = ${result}`);
}

// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for.
// Якщо число парне, пропустити його за допомогою continue.

for (let i = 2; i <= 20; i++) {
  if (i % 2 !== 0) {
    continue;
  }
  console.log(i);
}

// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

let i = 1;
while (i <= 10) {
  console.log(i);
  i++;
}
